zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_A.h
/*
 * Copyright 1997-2016 Freescale Semiconductor, Inc.
 * Copyright 2016-2025 NXP
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/*!
 * @file S32K566_XRDC_A.h
 * @version 2.2
 * @date 2025-10-16
 * @brief Peripheral Access Layer for S32K566_XRDC_A
 *
 * This file contains register definitions and macros for easy access to their
 * bit fields.
 *
 * This file assumes LITTLE endian system.
 */

/**
* @page misra_violations MISRA-C:2012 violations
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.3, local typedef not referenced
* The SoC header defines typedef for all modules.
*
* @section [global]
* Violates MISRA 2012 Advisory Rule 2.5, local macro not referenced
* The SoC header defines macros for all modules and registers.
*
* @section [global]
* Violates MISRA 2012 Advisory Directive 4.9, Function-like macro
* These are generated macros used for accessing the bit-fields from registers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.1, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.2, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.4, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 5.5, identifier clash
* The supported compilers use more than 31 significant characters for identifiers.
*
* @section [global]
* Violates MISRA 2012 Required Rule 21.1, defined macro '__I' is reserved to the compiler
* This type qualifier is needed to ensure correct I/O access and addressing.
*/

/* Prevention from multiple including the same memory map */
#if !defined(S32K566_XRDC_A_H_)  /* Check if memory map has not been already included */
#define S32K566_XRDC_A_H_

#include "S32K566_COMMON.h"

/* ----------------------------------------------------------------------------
   -- XRDC_A Peripheral Access Layer
   ---------------------------------------------------------------------------- */

/*!
 * @addtogroup XRDC_A_Peripheral_Access_Layer XRDC_A Peripheral Access Layer
 * @{
 */

/** XRDC_A - Size of Registers Arrays */
#define XRDC_A_MDAC_COUNT                         4u
#define XRDC_A_MRC_COUNT                          3u
#define XRDC_A_DERRLOC_COUNT                      16u
#define XRDC_A_DERRW0_COUNT                       18u
#define XRDC_A_PDAC_SLOT_PDACN_COUNT              86u
#define XRDC_A_PDAC_SLOT_COUNT                    2u
#define XRDC_A_MRCN_COUNT                         3u
#define XRDC_A_MRCN_MRGDN_COUNT                   16u

/** XRDC_A - Register Layout Typedef */
typedef struct XRDC_A_Struct {
  __IO uint32_t CR;                                /**< Control, offset: 0x0 */
  uint8_t RESERVED_0[236];
  __I  uint32_t HWCFG0;                            /**< Hardware Configuration 0, offset: 0xF0 */
  __I  uint32_t HWCFG1;                            /**< Hardware Configuration 1, offset: 0xF4 */
  __I  uint32_t HWCFG2;                            /**< Hardware Configuration 2, offset: 0xF8 */
  uint8_t RESERVED_1[4];
  __I  uint8_t MDACFG[XRDC_A_MDAC_COUNT];          /**< Master Domain Assignment Configuration, array offset: 0x100, array step: 0x1 */
  uint8_t RESERVED_2[60];
  __I  uint8_t MRCFG[XRDC_A_MRC_COUNT];            /**< Memory Region Configuration, array offset: 0x140, array step: 0x1 */
  uint8_t RESERVED_3[189];
  __I  uint32_t DERRLOC[XRDC_A_DERRLOC_COUNT];     /**< Domain Error Location, array offset: 0x200, array step: 0x4 */
  uint8_t RESERVED_4[448];
  struct XRDC_A_DERRW0 {                           /* offset: 0x400, array step: 0x10 */
    __I  uint32_t DERR_W0;                           /**< Domain Error Word 0, array offset: 0x400, array step: 0x10, valid indices: [0-2, 16-17] */
    __I  uint32_t DERR_W1;                           /**< Domain Error Word 1, array offset: 0x404, array step: 0x10, valid indices: [0-2, 16-17] */
    uint8_t RESERVED_0[4];
    __IO uint32_t DERR_W3;                           /**< Domain Error Word 3, array offset: 0x40C, array step: 0x10, valid indices: [0-2, 16-17] */
  } DERRW0[XRDC_A_DERRW0_COUNT];
  uint8_t RESERVED_5[736];
  __IO uint32_t MDA_W0_0_DFMT1;                    /**< Master Domain Assignment, offset: 0x800 */
  uint8_t RESERVED_6[28];
  __IO uint32_t MDA_W0_1_DFMT1;                    /**< Master Domain Assignment, offset: 0x820 */
  uint8_t RESERVED_7[28];
  __IO uint32_t MDA_W0_2_DFMT1;                    /**< Master Domain Assignment, offset: 0x840 */
  uint8_t RESERVED_8[28];
  __IO uint32_t MDA_W0_3_DFMT1;                    /**< Master Domain Assignment, offset: 0x860 */
  uint8_t RESERVED_9[1948];
  struct XRDC_A_PDAC_SLOT {                        /* offset: 0x1000, array step: 0x400 */
    struct XRDC_A_PDAC_SLOT_PDACN {                  /* offset: 0x1000, array step: index*0x400, index2*0x8 */
      __IO uint32_t PDAC_W0;                           /**< Peripheral Domain Access Control Word 0, array offset: 0x1000, array step: index*0x400, index2*0x8, valid indices: [0][1-2, 4-36, 46-49, 54-57, 60-66, 71-79, 81, 85], [1][0, 37-38, 45, 53, 69, 83-84] */
      __IO uint32_t PDAC_W1;                           /**< Peripheral Domain Access Control Word 1, array offset: 0x1004, array step: index*0x400, index2*0x8, valid indices: [0][1-2, 4-36, 46-49, 54-57, 60-66, 71-79, 81, 85], [1][0, 37-38, 45, 53, 69, 83-84] */
    } PDACN[XRDC_A_PDAC_SLOT_PDACN_COUNT];
    uint8_t RESERVED_0[336];
  } PDAC_SLOT[XRDC_A_PDAC_SLOT_COUNT];
  uint8_t RESERVED_10[2048];
  struct XRDC_A_MRGDN {                            /* offset: 0x2000, array step: index*0x200, index2*0x20 */
    __IO uint32_t XRDC_MRGD_W0;                      /**< Memory Region Descriptor Word 0, array offset: 0x2000, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-3], [2][0-7] */
    __IO uint32_t XRDC_MRGD_W1;                      /**< Memory Region Descriptor Word 1, array offset: 0x2004, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-3], [2][0-7] */
    __IO uint32_t XRDC_MRGD_W2;                      /**< Memory Region Descriptor Word 2, array offset: 0x2008, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-3], [2][0-7] */
    __IO uint32_t XRDC_MRGD_W3;                      /**< Memory Region Descriptor Word 3, array offset: 0x200C, array step: index*0x200, index2*0x20, valid indices: [0][0-15], [1][0-3], [2][0-7] */
    uint8_t RESERVED_0[16];
  } MRGDN[XRDC_A_MRCN_COUNT][XRDC_A_MRCN_MRGDN_COUNT];
} XRDC_A_Type, *XRDC_A_MemMapPtr;

/** Number of instances of the XRDC_A module. */
#define XRDC_A_INSTANCE_COUNT                    (1u)

