zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_A.h
#define XRDC_A_HWCFG2_PIDP9_MASK                 (0x200U)
#define XRDC_A_HWCFG2_PIDP9_SHIFT                (9U)
#define XRDC_A_HWCFG2_PIDP9_WIDTH                (1U)
#define XRDC_A_HWCFG2_PIDP9(x)                   (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP9_SHIFT)) & XRDC_A_HWCFG2_PIDP9_MASK)

#define XRDC_A_HWCFG2_PIDP10_MASK                (0x400U)
#define XRDC_A_HWCFG2_PIDP10_SHIFT               (10U)
#define XRDC_A_HWCFG2_PIDP10_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP10(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP10_SHIFT)) & XRDC_A_HWCFG2_PIDP10_MASK)

#define XRDC_A_HWCFG2_PIDP11_MASK                (0x800U)
#define XRDC_A_HWCFG2_PIDP11_SHIFT               (11U)
#define XRDC_A_HWCFG2_PIDP11_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP11(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP11_SHIFT)) & XRDC_A_HWCFG2_PIDP11_MASK)

#define XRDC_A_HWCFG2_PIDP12_MASK                (0x1000U)
#define XRDC_A_HWCFG2_PIDP12_SHIFT               (12U)
#define XRDC_A_HWCFG2_PIDP12_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP12(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP12_SHIFT)) & XRDC_A_HWCFG2_PIDP12_MASK)

#define XRDC_A_HWCFG2_PIDP13_MASK                (0x2000U)
#define XRDC_A_HWCFG2_PIDP13_SHIFT               (13U)
#define XRDC_A_HWCFG2_PIDP13_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP13(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP13_SHIFT)) & XRDC_A_HWCFG2_PIDP13_MASK)

#define XRDC_A_HWCFG2_PIDP14_MASK                (0x4000U)
#define XRDC_A_HWCFG2_PIDP14_SHIFT               (14U)
#define XRDC_A_HWCFG2_PIDP14_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP14(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP14_SHIFT)) & XRDC_A_HWCFG2_PIDP14_MASK)

#define XRDC_A_HWCFG2_PIDP15_MASK                (0x8000U)
#define XRDC_A_HWCFG2_PIDP15_SHIFT               (15U)
#define XRDC_A_HWCFG2_PIDP15_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP15(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP15_SHIFT)) & XRDC_A_HWCFG2_PIDP15_MASK)

#define XRDC_A_HWCFG2_PIDP16_MASK                (0x10000U)
#define XRDC_A_HWCFG2_PIDP16_SHIFT               (16U)
#define XRDC_A_HWCFG2_PIDP16_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP16(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP16_SHIFT)) & XRDC_A_HWCFG2_PIDP16_MASK)

#define XRDC_A_HWCFG2_PIDP17_MASK                (0x20000U)
#define XRDC_A_HWCFG2_PIDP17_SHIFT               (17U)
#define XRDC_A_HWCFG2_PIDP17_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP17(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP17_SHIFT)) & XRDC_A_HWCFG2_PIDP17_MASK)

#define XRDC_A_HWCFG2_PIDP18_MASK                (0x40000U)
#define XRDC_A_HWCFG2_PIDP18_SHIFT               (18U)
#define XRDC_A_HWCFG2_PIDP18_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP18(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP18_SHIFT)) & XRDC_A_HWCFG2_PIDP18_MASK)

#define XRDC_A_HWCFG2_PIDP19_MASK                (0x80000U)
#define XRDC_A_HWCFG2_PIDP19_SHIFT               (19U)
#define XRDC_A_HWCFG2_PIDP19_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP19(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP19_SHIFT)) & XRDC_A_HWCFG2_PIDP19_MASK)

#define XRDC_A_HWCFG2_PIDP20_MASK                (0x100000U)
#define XRDC_A_HWCFG2_PIDP20_SHIFT               (20U)
#define XRDC_A_HWCFG2_PIDP20_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP20(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP20_SHIFT)) & XRDC_A_HWCFG2_PIDP20_MASK)

#define XRDC_A_HWCFG2_PIDP21_MASK                (0x200000U)
#define XRDC_A_HWCFG2_PIDP21_SHIFT               (21U)
#define XRDC_A_HWCFG2_PIDP21_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP21(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP21_SHIFT)) & XRDC_A_HWCFG2_PIDP21_MASK)

#define XRDC_A_HWCFG2_PIDP22_MASK                (0x400000U)
#define XRDC_A_HWCFG2_PIDP22_SHIFT               (22U)
#define XRDC_A_HWCFG2_PIDP22_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP22(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP22_SHIFT)) & XRDC_A_HWCFG2_PIDP22_MASK)

#define XRDC_A_HWCFG2_PIDP23_MASK                (0x800000U)
#define XRDC_A_HWCFG2_PIDP23_SHIFT               (23U)
#define XRDC_A_HWCFG2_PIDP23_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP23(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP23_SHIFT)) & XRDC_A_HWCFG2_PIDP23_MASK)

#define XRDC_A_HWCFG2_PIDP24_MASK                (0x1000000U)
#define XRDC_A_HWCFG2_PIDP24_SHIFT               (24U)
#define XRDC_A_HWCFG2_PIDP24_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP24(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP24_SHIFT)) & XRDC_A_HWCFG2_PIDP24_MASK)

#define XRDC_A_HWCFG2_PIDP25_MASK                (0x2000000U)
#define XRDC_A_HWCFG2_PIDP25_SHIFT               (25U)
#define XRDC_A_HWCFG2_PIDP25_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP25(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP25_SHIFT)) & XRDC_A_HWCFG2_PIDP25_MASK)

#define XRDC_A_HWCFG2_PIDP26_MASK                (0x4000000U)
#define XRDC_A_HWCFG2_PIDP26_SHIFT               (26U)
#define XRDC_A_HWCFG2_PIDP26_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP26(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP26_SHIFT)) & XRDC_A_HWCFG2_PIDP26_MASK)

#define XRDC_A_HWCFG2_PIDP27_MASK                (0x8000000U)
#define XRDC_A_HWCFG2_PIDP27_SHIFT               (27U)
#define XRDC_A_HWCFG2_PIDP27_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP27(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP27_SHIFT)) & XRDC_A_HWCFG2_PIDP27_MASK)

#define XRDC_A_HWCFG2_PIDP28_MASK                (0x10000000U)
#define XRDC_A_HWCFG2_PIDP28_SHIFT               (28U)
#define XRDC_A_HWCFG2_PIDP28_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP28(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP28_SHIFT)) & XRDC_A_HWCFG2_PIDP28_MASK)

#define XRDC_A_HWCFG2_PIDP29_MASK                (0x20000000U)
#define XRDC_A_HWCFG2_PIDP29_SHIFT               (29U)
#define XRDC_A_HWCFG2_PIDP29_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP29(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP29_SHIFT)) & XRDC_A_HWCFG2_PIDP29_MASK)

#define XRDC_A_HWCFG2_PIDP30_MASK                (0x40000000U)
#define XRDC_A_HWCFG2_PIDP30_SHIFT               (30U)
#define XRDC_A_HWCFG2_PIDP30_WIDTH               (1U)
#define XRDC_A_HWCFG2_PIDP30(x)                  (((uint32_t)(((uint32_t)(x)) << XRDC_A_HWCFG2_PIDP30_SHIFT)) & XRDC_A_HWCFG2_PIDP30_MASK)

