zephyrproject-rtos/hal_nxp/s32/drivers/s32k5/BaseNXP/header/S32K566_XRDC_A.h
#define XRDC_A_XRDC_MRGD_W2_SE_MASK              (0x40000000U)
#define XRDC_A_XRDC_MRGD_W2_SE_SHIFT             (30U)
#define XRDC_A_XRDC_MRGD_W2_SE_WIDTH             (1U)
#define XRDC_A_XRDC_MRGD_W2_SE(x)                (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W2_SE_SHIFT)) & XRDC_A_XRDC_MRGD_W2_SE_MASK)
/*! @} */

/*! @name XRDC_MRGD_W3 - Memory Region Descriptor Word 3 */
/*! @{ */

#define XRDC_A_XRDC_MRGD_W3_D8ACP_MASK           (0x7U)
#define XRDC_A_XRDC_MRGD_W3_D8ACP_SHIFT          (0U)
#define XRDC_A_XRDC_MRGD_W3_D8ACP_WIDTH          (3U)
#define XRDC_A_XRDC_MRGD_W3_D8ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D8ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D8ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D9ACP_MASK           (0x38U)
#define XRDC_A_XRDC_MRGD_W3_D9ACP_SHIFT          (3U)
#define XRDC_A_XRDC_MRGD_W3_D9ACP_WIDTH          (3U)
#define XRDC_A_XRDC_MRGD_W3_D9ACP(x)             (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D9ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D9ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D10ACP_MASK          (0x1C0U)
#define XRDC_A_XRDC_MRGD_W3_D10ACP_SHIFT         (6U)
#define XRDC_A_XRDC_MRGD_W3_D10ACP_WIDTH         (3U)
#define XRDC_A_XRDC_MRGD_W3_D10ACP(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D10ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D10ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D11ACP_MASK          (0xE00U)
#define XRDC_A_XRDC_MRGD_W3_D11ACP_SHIFT         (9U)
#define XRDC_A_XRDC_MRGD_W3_D11ACP_WIDTH         (3U)
#define XRDC_A_XRDC_MRGD_W3_D11ACP(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D11ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D11ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D12ACP_MASK          (0x7000U)
#define XRDC_A_XRDC_MRGD_W3_D12ACP_SHIFT         (12U)
#define XRDC_A_XRDC_MRGD_W3_D12ACP_WIDTH         (3U)
#define XRDC_A_XRDC_MRGD_W3_D12ACP(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D12ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D12ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D13ACP_MASK          (0x38000U)
#define XRDC_A_XRDC_MRGD_W3_D13ACP_SHIFT         (15U)
#define XRDC_A_XRDC_MRGD_W3_D13ACP_WIDTH         (3U)
#define XRDC_A_XRDC_MRGD_W3_D13ACP(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D13ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D13ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D14ACP_MASK          (0x1C0000U)
#define XRDC_A_XRDC_MRGD_W3_D14ACP_SHIFT         (18U)
#define XRDC_A_XRDC_MRGD_W3_D14ACP_WIDTH         (3U)
#define XRDC_A_XRDC_MRGD_W3_D14ACP(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D14ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D14ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_D15ACP_MASK          (0xE00000U)
#define XRDC_A_XRDC_MRGD_W3_D15ACP_SHIFT         (21U)
#define XRDC_A_XRDC_MRGD_W3_D15ACP_WIDTH         (3U)
#define XRDC_A_XRDC_MRGD_W3_D15ACP(x)            (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_D15ACP_SHIFT)) & XRDC_A_XRDC_MRGD_W3_D15ACP_MASK)

#define XRDC_A_XRDC_MRGD_W3_LK2_MASK             (0x60000000U)
#define XRDC_A_XRDC_MRGD_W3_LK2_SHIFT            (29U)
#define XRDC_A_XRDC_MRGD_W3_LK2_WIDTH            (2U)
#define XRDC_A_XRDC_MRGD_W3_LK2(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_LK2_SHIFT)) & XRDC_A_XRDC_MRGD_W3_LK2_MASK)

#define XRDC_A_XRDC_MRGD_W3_VLD_MASK             (0x80000000U)
#define XRDC_A_XRDC_MRGD_W3_VLD_SHIFT            (31U)
#define XRDC_A_XRDC_MRGD_W3_VLD_WIDTH            (1U)
#define XRDC_A_XRDC_MRGD_W3_VLD(x)               (((uint32_t)(((uint32_t)(x)) << XRDC_A_XRDC_MRGD_W3_VLD_SHIFT)) & XRDC_A_XRDC_MRGD_W3_VLD_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group XRDC_A_Register_Masks */

/*!
 * @}
 */ /* end of group XRDC_A_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K566_XRDC_A_H_) */
